In [8]:
import numpy as np
import pandas as pd

In [9]:
data = np.random.randn(4,3)

In [10]:
data

array([[ 0.17773329, -0.12955396, -1.54450146],
       [ 1.44416921,  0.10973605, -0.66300348],
       [ 0.21315882, -0.5425027 , -0.62723665],
       [-1.69067336, -0.07466395,  1.38208338]])

In [11]:
dataFrame = pd.DataFrame(data)

In [12]:
dataFrame

          0         1         2
0  0.177733 -0.129554 -1.544501
1  1.444169  0.109736 -0.663003
2  0.213159 -0.542503 -0.627237
3 -1.690673 -0.074664  1.382083

In [13]:
dataFrame[0]

0    0.177733
1    1.444169
2    0.213159
3   -1.690673
Name: 0, dtype: float64

In [14]:
type(dataFrame[0])

pandas.core.series.Series

In [15]:
dataFrame

          0         1         2
0  0.177733 -0.129554 -1.544501
1  1.444169  0.109736 -0.663003
2  0.213159 -0.542503 -0.627237
3 -1.690673 -0.074664  1.382083

In [16]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [17]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.177733 -0.129554      -1.544501
Zeynep  1.444169  0.109736      -0.663003
Atlas   0.213159 -0.542503      -0.627237
Mehmet -1.690673 -0.074664       1.382083

In [18]:
yeniDataFrame["Yas"]

Atil     -0.129554
Zeynep    0.109736
Atlas    -0.542503
Mehmet   -0.074664
Name: Yas, dtype: float64

In [19]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.177733 -0.129554
Zeynep  1.444169  0.109736
Atlas   0.213159 -0.542503
Mehmet -1.690673 -0.074664

In [20]:
yeniDataFrame.loc["Atil"]

Maas             0.177733
Yas             -0.129554
Calisma Saati   -1.544501
Name: Atil, dtype: float64

In [21]:
yeniDataFrame.iloc[1]

Maas             1.444169
Yas              0.109736
Calisma Saati   -0.663003
Name: Zeynep, dtype: float64

In [22]:
yeniDataFrame["Maas"]

Atil      0.177733
Zeynep    1.444169
Atlas     0.213159
Mehmet   -1.690673
Name: Maas, dtype: float64

In [23]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"]+yeniDataFrame["Yas"]

In [24]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.177733 -0.129554      -1.544501       -0.259108
Zeynep  1.444169  0.109736      -0.663003        0.219472
Atlas   0.213159 -0.542503      -0.627237       -1.085005
Mehmet -1.690673 -0.074664       1.382083       -0.149328

In [25]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1)

            Maas       Yas  Calisma Saati
Atil    0.177733 -0.129554      -1.544501
Zeynep  1.444169  0.109736      -0.663003
Atlas   0.213159 -0.542503      -0.627237
Mehmet -1.690673 -0.074664       1.382083

In [26]:
yeniDataFrame.drop("Mehmet")

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.177733 -0.129554      -1.544501       -0.259108
Zeynep  1.444169  0.109736      -0.663003        0.219472
Atlas   0.213159 -0.542503      -0.627237       -1.085005

### inplace parametresi ile kalıcı silme işlemi

In [27]:
yeniDataFrame.drop("Emeklilik Yasi", axis=1, inplace=True)

In [28]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.177733 -0.129554      -1.544501
Zeynep  1.444169  0.109736      -0.663003
Atlas   0.213159 -0.542503      -0.627237
Mehmet -1.690673 -0.074664       1.382083

### hücrelere erişme

In [29]:
yeniDataFrame.loc["Atil"]["Yas"]

-0.12955395776809123

In [30]:
yeniDataFrame.loc["Atlas","Yas"]

-0.5425026971901517

In [31]:
booleanFrame = yeniDataFrame < 0

In [32]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil    False   True           True
Zeynep  False  False           True
Atlas   False   True           True
Mehmet   True   True          False

In [33]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil         NaN -0.129554      -1.544501
Zeynep       NaN       NaN      -0.663003
Atlas        NaN -0.542503      -0.627237
Mehmet -1.690673 -0.074664            NaN

In [34]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil         NaN -0.129554      -1.544501
Zeynep       NaN       NaN      -0.663003
Atlas        NaN -0.542503      -0.627237
Mehmet -1.690673 -0.074664            NaN

In [35]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Calisma Saati
Zeynep  1.444169  0.109736      -0.663003

In [36]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.177733 -0.129554      -1.544501
Zeynep  1.444169  0.109736      -0.663003
Atlas   0.213159 -0.542503      -0.627237
Mehmet -1.690673 -0.074664       1.382083

### index degistirme

In [37]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  0.177733 -0.129554      -1.544501
1  Zeynep  1.444169  0.109736      -0.663003
2   Atlas  0.213159 -0.542503      -0.627237
3  Mehmet -1.690673 -0.074664       1.382083

In [38]:
yeniIndexListesi = ["Ati","Zey","Atl","Meh"]

In [39]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [40]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Index
Atil    0.177733 -0.129554      -1.544501        Ati
Zeynep  1.444169  0.109736      -0.663003        Zey
Atlas   0.213159 -0.542503      -0.627237        Atl
Mehmet -1.690673 -0.074664       1.382083        Meh

In [41]:
yeniDataFrame.set_index("Yeni Index", inplace = True)

In [42]:
yeniDataFrame

                Maas       Yas  Calisma Saati
Yeni Index
Ati         0.177733 -0.129554      -1.544501
Zey         1.444169  0.109736      -0.663003
Atl         0.213159 -0.542503      -0.627237
Meh        -1.690673 -0.074664       1.382083

In [43]:
yeniDataFrame.loc["Ati"]

Maas             0.177733
Yas             -0.129554
Calisma Saati   -1.544501
Name: Ati, dtype: float64

### multi index

In [44]:
ilkIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [45]:
icIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [46]:
birlesmisIndex = list(zip(ilkIndex, icIndex))

In [47]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [51]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [52]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [53]:
listem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [54]:
numpyDizim = np.array(listem)

In [56]:
filmDataFrame = pd.DataFrame(numpyDizim, index = birlesmisIndex, columns = ["Yas","Meslek"])

In [57]:
filmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [59]:
filmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [63]:
filmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [66]:
filmDataFrame.index.names = ["Film Adı","İsim"]

In [67]:
filmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F